        03 LIB2-I.
           05  LIB2-I-KEY                      PIC  X(005).
        03 LIB2-O.
           05  LIB2-O-ERR                      PIC  X(005).
           05  LIB2-O-DATA                     PIC  X(080).
